better mermaid
